[
    {
        "title": "Limited time offer on Student Bank Accounts",
        "recipient": "Ron Smith",
        "sender": "Tom Bosh",
        "body": "Dear Ron, Enjoy student banking that sets you free. Get a debit card for all your day-to-day banking and to securely pay for purchases directly from your bank account. You will get no monthly fees, and also unlimited debit transactions. Your credit card should get you rewards easily. Earn travel, cash back or retail perks while you build your credit. Applying takes about 5 minutes, and you’ll get a response in as little as 60 seconds. You’ll be able to shop and save, with up to 2% cash back on groceries, collect points to get free flights, and get free goodies as well. The Education Line of Credit is for you if you need access to funds while attending an accredited university or college to cover tuition, textbooks and other daily personal expenses. The Professional Student Program can help you cover the cost of books, tuition and residency (depending on your field of study). You only pay interest while you’re in school and for up to 2 years after you graduate. For more details, please visit the nearest branch. Thanks, Tom Bosh."
    },
    {
        "title": "Minimum Balance",
        "recipient": "Ron Smith",
        "sender": "Tom Bosh",
        "body": "Dear Ron, On a review of our books we find that you have not been maintaining the prescribed minimum balance in your above-mentioned account. I may, therefore, draw attention to our rule No. 19 (mentioned in the first few pages of the pass-book) according to which a minimum balance of $100.00 is to be maintained by any customer desiring withdrawals by cheque. Please make arrangement to remit the necessary amount and also ensure that a shortfall like this is not repeated. We could have dishonoured your last cheque which led to the shortfall, but our consideration for your reputation as an old, reputable customer did not allow us to do so. We likewise trust that you will co-operate with us in this regard and do the needful without further delay. Yours faithfully, Tom Bosh."
    },
    {
        "title": "Invest Smart",
        "recipient": "Ron Smith",
        "sender": "Mallory Lambert",
        "body": "Dear Ron, You're a leader, not a follower. Likewise. For over 30 years, we've been empowering people to invest for themselves. Today, millions of people like you have joined us and made us the largest online broker in the country. Find out how and why we are driven to help you succeed. There can be a real satisfaction investing for yourself. Take charge of your portfolio with your trading and investing experience. Want streaming level 2 data and complex strategies? Done. Prefer a few taps on an app? Done. We provide trading platforms for any level of investor, accessible online and on the go. Build your portfolio with stocks, options, ETFs, mutual funds, GICs, bonds, IPOs or new issues. Trade on Canadian and U.S. markets. Visit us at your nearest branch. Thanks, Mallory Lambert."
    },
    {
        "title": "Account Closure",
        "recipient": "Ron Smith",
        "sender": "Mallory Lambert",
        "body": "Dear Ron, We regret to note that you have closed your above account with us. We surely believe that this closure did not result from any act of omission on our part. It might have been due to circumstances beyond your control. As you know this is always our practice to render helpful service to our clients and leave no scope for complaint against us, yet if we have been at fault, you must feel at ease to tell us frankly so. We always appreciate constructive criticism and are prepared to review any of our acts of omission or commission. However, if your decision to close this account is final and if you are not opening a new account anywhere else, then it is a different matter. But in case the need arises to open another account, we hope, you will only do it here with us. You hardly need to be reassured that we always welcome and value our old customers, and consider it a privilege to serve them with the same customary zeal. Yours faithfully, Mallory Lambert"
    },


    {
        "title": "Opening a Bank Account",
        "recipient": "Mary Wong",
        "sender": "Fred Young",
        "body": "Dear Mary, I hope this letter finds you happy and healthy. In our last meeting, you mentioned you have recently retired and are looking for a bank to invest your pension money in. I offer you an excellent opportunity to open your account in our bank. It is my personal recommendation as we offer the highest rate of interest on investments by retired individuals and will facilitate you in spending your life burden and hassle free. We also offer complimentary online banking, debit card and chequebooks free of cost along with reduced interest rates on any loans which you might take in the future. We care for our every customer at a personal level and try our best in helping you reach your financial goals and achieve financial freedom. I am looking forward to meeting you in person to discuss further details in this regard. Sincerely, Fred Young"
    },
    {
        "title": "Overdraft Facility",
        "recipient": "Fred Young",
        "sender": "Mary Wong",
        "body": "Dear Fred, We currently have an account with you bearing no. 239230. Our monthly turnover is above $1000.00 and our amount has never been overdrawn against our current account. Besides, not a single cheque of ours has been returned ever since we opened an account with you about 12 ago. As we are now planning to enter into export market, we need additional funds of $20000. We have been able to raise $5000 from our friends and other sources but we still need $15000 and hence we approach you for an overdraft facility of this amount. We are enclosing a photocopy of our assessment for your perusal and also copies of balance sheets and profit and loss account for the last three years. We can mortgage our stock, which is always worth $10000 and above. Looking forward to your immediate action in the matter. Thanks, Mary Wong"
    },
    {
        "title": "Special offer and an Introduction",
        "recipient": "Mary Wong",
        "sender": "Gordon Simmons",
        "body": "Hello Mary, I would like to introduce myself as the new branch relational manager. We have recently introduced a new policy in which it is stated that when a person opens a bank account on our bank they will be given the following benefits: Free checkbook, Free ATM card, a 0.2% increased interest on the first deposit for the first 6 months. We highly respect our customers’ concerns and try to provide the best interest rates and service. We have also introduced our online banking system which can be operated through our app. We would like to extend a warm welcome to our bank. Regards, Gordon Simmons"
    },
    {
        "title": "Letter to our Customers",
        "recipient": "Mary Wong",
        "sender": "Gordon Simmons",
        "body": "Hello customers, I'm very pleased to report that our bank has grown to over $391 million in total assets as of this month. Both our main operating units continue to see steady growth in loans and deposits. This growth is thanks to the efforts of our experienced banking team, community board members, bank directors, and our loyal customers. We continue to focus on generating new local deposits. These local deposits are critical to our growth plans, since they are the fuel for our continued growth. Please take a moment to check out our updated website. Here you will find information on our products and services, along with current special offers. We also now have Facebook pages available where you can see the latest events we are sponsoring in the community as well as trending financial articles. We are grateful for the response we've received from the public since we opened for business in 2007. Your referrals have been, and will continue to be, so important to the success of the bank. Please tell your friends, neighbors, and business associates about us. We will always work hard to earn their confidence and exceed their customer service expectations. Thank you again for your continued support. Call us or stop in whenever you have any questions. Please feel free to give us your suggestions so we can better serve you. Best wishes to you and your family. Gordon Simmons"
    }
]